import React from "react";
import ArticleCard from "../article-card/ArticleCard";
import blanchettCover from "./blanchett-cover.jpg";

const RecentArticles = () => {
  return (
    <>
      <section className="recent-articles">
        <h2 className="recent-articles__heading">Статьи</h2>
        <div className="container">
          <ArticleCard
            img={blanchettCover}
            heading="10 лучших фильмов с Кейт Бланшетт"
            description='Фильмография Кейт Бланшетт - впечатляющая демонстрация ее невероятного таланта и многогранности как актрисы. Ее карьера насчитывает более трех десятилетий, она сыграла множество персонажей в различных жанрах. Бланшетт сыграла в таких признанных критиками фильмах, как "Не смотри вверх", "Широко закрытые глаза" и "TÁR", заслужив множество наград, в том числе две премии "Оскар" за лучшую женскую роль.'
          />
          <ArticleCard
            img={blanchettCover}
            heading="10 лучших фильмов с Кейт Бланшетт"
            description='Фильмография Кейт Бланшетт - впечатляющая демонстрация ее невероятного таланта и многогранности как актрисы. Ее карьера насчитывает более трех десятилетий, она сыграла множество персонажей в различных жанрах. Бланшетт сыграла в таких признанных критиками фильмах, как "Не смотри вверх", "Широко закрытые глаза" и "TÁR", заслужив множество наград, в том числе две премии "Оскар" за лучшую женскую роль.'
          />
          <ArticleCard
            img={blanchettCover}
            heading="10 лучших фильмов с Кейт Бланшетт"
            description='Фильмография Кейт Бланшетт - впечатляющая демонстрация ее невероятного таланта и многогранности как актрисы. Ее карьера насчитывает более трех десятилетий, она сыграла множество персонажей в различных жанрах. Бланшетт сыграла в таких признанных критиками фильмах, как "Не смотри вверх", "Широко закрытые глаза" и "TÁR", заслужив множество наград, в том числе две премии "Оскар" за лучшую женскую роль.'
          />
          <ArticleCard
            img={blanchettCover}
            heading="10 лучших фильмов с Кейт Бланшетт"
            description='Фильмография Кейт Бланшетт - впечатляющая демонстрация ее невероятного таланта и многогранности как актрисы. Ее карьера насчитывает более трех десятилетий, она сыграла множество персонажей в различных жанрах. Бланшетт сыграла в таких признанных критиками фильмах, как "Не смотри вверх", "Широко закрытые глаза" и "TÁR", заслужив множество наград, в том числе две премии "Оскар" за лучшую женскую роль.'
          />
          <ArticleCard
            img={blanchettCover}
            heading="10 лучших фильмов с Кейт Бланшетт"
            description='Фильмография Кейт Бланшетт - впечатляющая демонстрация ее невероятного таланта и многогранности как актрисы. Ее карьера насчитывает более трех десятилетий, она сыграла множество персонажей в различных жанрах. Бланшетт сыграла в таких признанных критиками фильмах, как "Не смотри вверх", "Широко закрытые глаза" и "TÁR", заслужив множество наград, в том числе две премии "Оскар" за лучшую женскую роль.'
          />
          <ArticleCard
            img={blanchettCover}
            heading="10 лучших фильмов с Кейт Бланшетт"
            description='Фильмография Кейт Бланшетт - впечатляющая демонстрация ее невероятного таланта и многогранности как актрисы. Ее карьера насчитывает более трех десятилетий, она сыграла множество персонажей в различных жанрах. Бланшетт сыграла в таких признанных критиками фильмах, как "Не смотри вверх", "Широко закрытые глаза" и "TÁR", заслужив множество наград, в том числе две премии "Оскар" за лучшую женскую роль.'
          />
        </div>
      </section>
      <hr />
    </>
  );
};

export default RecentArticles;
